Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: Development versions of Debian/PowerPC were available in 1998 and 1999.
pt_pt: Versões de desenvolvimento do Debian/PowerPC estavam disponíveis em 1998 e 1999.

source: The port was officially released for the first time with Debian GNU/Linux 2.2 ("potato"), in August 2000.
pt_pt: O porte foi oficialmente lançado pela primeira vez com o Debian GNU/Linux 2.2 ("potato") em agosto de 2000.

source: The development of the port continues.
pt_pt: O desenvolvimento do porte continua.

source: A build daemon has been set up on voltaire.debian.org, a PowerPC machine donated by Daniel Jacobowitz, also a Debian developer.
pt_pt: Um daemon de construção foi configurado em voltaire.debian.org, uma máquina PowerPC doada por Daniel Jacobowitz, também um desenvolvedor Debian.

source: català dansk Deutsch español français hrvatski Italiano Nederlands Português Русский (Russkij) suomi svenska
pt_pt: català dansk Deutsch English español français hrvatski Italiano Nederlands Русский (Russkij) suomi svenska

source: Last Modified: Wed, Dec 14 20:50:12 UTC 2011 Last Built: Tue, Aug 6 19:48:44 UTC 2024
pt_pt: Última Modificação: Seg, 14 de Mar de 2022, 18:43:22 UTC Última compilação: Ter, 6 de Ago de 2024, 22:08:05 UTC

source: Copyright © 1997-2011 SPI and others; See license terms
pt_pt: Copyright © 1997-2022 SPI e outros; Veja os termos de licença

source: Debian Developers' Corner / How to join Debian / Advocating a prospective member
pt_pt: Canto dos(as) desenvolvedores(as) Debian / Como ingressar no Debian / Advogando a favor de um(a) futuro(a) membro(a

source: Advocating a prospective member
pt_pt: Advogando a favor de um(a) futuro(a) membro(a

source: Before advocating a prospective member, you should check that they satisfy all things listed on the NM checklist.
pt_pt: Antes de advogar a favor de um(a) futuro(a) membro(a), verifique se ele(a) satisfaz todas as coisas listadas no checklist NM.

source: You should only advocate someone if you think that they are ready to be a project member.
pt_pt: Você deve apenas advogar alguém se achar que ele(a) está pronto(a) para ser um(a) membro(a) do projeto.

source: This means that you should have known them for some time and can judge their work.
pt_pt: Isso significa que você deve conhecê-lo(a) há algum tempo e pode julgar o seu trabalho.

source: It is important that prospective members have been working in the project for some time.
pt_pt: É importante que o(a) futuro(a) membro(a) trabalhe no projeto há algum tempo.

source: Some ways prospective members might be contributing include:
pt_pt: Algumas maneiras pelas quais o(a) futuro(a) membro(a) pode contribuir incluem:

source: · maintaining a package (or several),
pt_pt: · mantendo um pacote (ou vários),

source: · helping users,
pt_pt: · ajudando usuários(as),

source: · publicity work,
pt_pt: · trabalhando na publicidade,

source: · translations,
pt_pt: · fazendo traduções,

source: · organizing work for debconf,
pt_pt: · organizando a DebConf,

source: · sending patches,
pt_pt: · enviando patches,

source: · contributing bug reports,
pt_pt: · contribuindo em relatórios de bugs,

source: · ... and much more!
pt_pt: · ... e muito mais!

source: These ways of helping are not mutually exclusive, of course!
pt_pt: Essas formas de ajudar não são mutuamente exclusivas, é claro!

source: Many prospective members will have done work in several areas of the project, and not everyone must be a packager.
pt_pt: Muitos(as) futuros(as) membros(as) trabalharão em várias áreas do projeto e nem todos(as) serão empacotadores(as).

source: Remember, Debian welcomes non-packaging contributors as project members.
pt_pt: Lembre-se, o Debian dá boas-vindas a contribuidores(as) não empacotadores(as) como membros(as) do projeto.

source: For a wider overview of a given contributor, you may be interested in tools which aggregate some publicly-visible parts of the project.
pt_pt: Para uma visão geral mais ampla de um(a) determinado(a) contribuidor(a), você pode estar interessado em ferramentas que agregam algumas partes visíveis publicamente do projeto.

source: Your personal knowledge of the applicant is also important here.
pt_pt: Seu conhecimento pessoal do(a) candidato(a) também é importante aqui.

source: The prospective member should be familiar with Debian's special ways of doing things and should have already contributed actively and effectively to the project.
pt_pt: O(A) futuro(a) membro(a) deve estar familiarizado(a) com as maneiras especiais de fazer coisas do Debian e já deve ter contribuído ativamente e efetivamente para o projeto.

source: Most importantly, they should be committed to the ideals and structure of the Debian project.
pt_pt: Mais importante, ele(a) deve estar comprometido(a) com os ideais e a estrutura do projeto Debian.

source: Ask yourself if you want to see them in Debian – if you think they should be a Debian Developer then go ahead and encourage them to apply.
pt_pt: Pergunte a si mesmo(a) se você deseja vê-lo(a) no Debian – se você acha que ele(a) deve ser um(a) desenvolvedor(a) Debian, vá em frente e incentive-o(a) a se candidatar.

source: Next carry out the following steps: Agree with the prospective member to recommend them and let them sign up.
pt_pt: Em seguida execute os seguintes passos: concorde em recomendar o(a) futuro(a) membro(a) e deixe ele(a) se inscrever.

source: After that, you have to click on their name in the listing of Applicants and go the Advocate this application page.
pt_pt: Depois disso, você deve clicar no nome dele(a) na lista de candidatos(as) e acessar a página advogue em favor dessa candidatura.

source: Enter your Debian login and press the Advocate button.
pt_pt: Digite seu login Debian e pressione o botão Advocate.

source: You then will receive an e-mail with an auth key which you have to return OpenPGP signed.
pt_pt: Você receberá um e-mail com uma chave de autenticação, a qual deverá enviar uma resposta assinada com OpenPGP.

source: After this, the Applicant is added to the queue for an Application Manager with whom they will go through all steps of the New Member checks.
pt_pt: Depois disso, o(a) candidato(a) será adicionado(a) à fila de espera por um(a) gestor de candidatura com quem ele(a) passará por todas as etapas das verificações de novos(as) membros(as).

source: See also the Advocacy Tips wiki page.
pt_pt: Veja também a página wiki com dicas para advogar.

source: Deutsch español français Italiano Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) svenska
pt_pt: Deutsch English español français Italiano Nederlands 日本語 (Nihongo) polski Русский (Russkij) svenska

source: Last Modified: Fri, Oct 6 21:55:11 UTC 2023 Last Built: Tue, Aug 6 19:41:26 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Abr de 2024, 18:44:21 UTC Última compilação: Ter, 6 de Ago de 2024, 22:05:08 UTC

source: Debian Developers' Corner / Helping with the Debian web pages / Examples
pt_pt: Canto dos(as) desenvolvedores(as) Debian / Ajudando com as páginas web do Debian / Exemplos

source: Example of Starting a Translation
pt_pt: Exemplo de como iniciar uma tradução

source: French will be used for the example:
pt_pt: O idioma francês será usado como exemplo:

source: Edit the .wmlrc file and change:
pt_pt: Edite o arquivo .wmlrc e altere:

source: · '-D CUR_LANG=English' to '-D CUR_LANG=French'
pt_pt: · '-D CUR_LANG=English' para '-D CUR_LANG=French'

source: · '-D CUR_ISO_LANG=en' to '-D CUR_ISO_LANG=fr'
pt_pt: · '-D CUR_ISO_LANG=en' para '-D CUR_ISO_LANG=fr'

source: · '-D CUR_LOCALE=en_US' to '-D CUR_LOCALE=fr_FR'
pt_pt: · '-D CUR_LOCALE=en_US' para '-D CUR_LOCALE=fr_FR'

source: · '-D CHARSET=iso-8859-1' to whatever is appropriate.
pt_pt: · '-D CHARSET=iso-8859-1' para o que for apropriado.

source: French just happens to use the same character encoding as English so no change is necessary, however it's likely that new languages will need to have this setting adjusted.
pt_pt: O francês coincidentemente usa a mesma codificação de caracteres que o inglês, logo nenhuma alteração é necessária. Contudo, é provável que novos idiomas precisem ter essa configuração ajustada.

source: Edit Make.lang and change 'LANGUAGE := en' to 'LANGUAGE := fr'.
pt_pt: Edite o Make.lang e altere 'LANGUAGE := en' para 'LANGUAGE := fr'.

source: In case you are translating to a language which uses a multi-byte charset, you may have to change some other variables in that file, for more information read ../Makefile.common and perhaps other working examples (translations such as Chinese).
pt_pt: Caso esteja traduzindo para um idioma que usa um conjunto de caracteres multi-byte, pode ser necessário alterar algumas outras variáveis nesse arquivo. Para mais informações leia ../Makefile.common e talvez outros exemplos funcionais (traduções como a chinesa).

source: Go to french/po and translate entries in PO files.
pt_pt: Vá para french/po e traduza as entradas nos arquivos PO.

source: This should be quite straightforward.
pt_pt: Isso deve ser bastante simples.

source: Always make sure you copy the Makefile to each directory you translate.
pt_pt: Sempre certifique-se de copiar o Makefile para cada diretório que você traduzir.

source: This is necessary because the program make is used to convert the .wml files into HTML, and make uses Makefiles.
pt_pt: Isso é necessário porque o programa make é usado para converter os arquivos .wml em HTML, e o make usa Makefiles.

source: When you are done adding and editing pages, do a
pt_pt: Quando terminar de adicionar e editar as páginas, faça um

source: git commit -m "Add your commit message here"
pt_pt: git commit -m "Adicione aqui uma messagem de commit"

source: from the webwml directory.
pt_pt: a partir do diretório webwml.

source: You can now start translating the pages.
pt_pt: Você agora pode começar a traduzir as páginas.

source: Example of Translating a Page
pt_pt: Exemplo de tradução de uma página

source: A French translation of the social contract will be used for the example:
pt_pt: Uma tradução francesa do contrato social será usada como exemplo:

source: This will automatically add the translation-check header, pointing to the version of the original file which was copied.
pt_pt: Isso irá automaticamente adicionar o cabeçalho translation-check, apontando para a versão do arquivo original que foi copiado.

source: It also creates the destination directory and Makefile, if missing.
pt_pt: Isso também cria o diretório de destino e o Makefile, se estiver faltando.

source: Edit social_contract.wml and translate the text.
pt_pt: Edite o arquivo social_contract.wml e traduza o texto.

source: Do not try to translate any links or change them in any way - if you want to change anything, request it on the debian-www list.
pt_pt: Não tente traduzir quaisquer links ou alterá-los de qualquer modo - se você deseja mudar alguma coisa, solicite-a na lista debian-www.

source: When done, type
pt_pt: Quando terminar, execute

source: Example of Adding a New Directory
pt_pt: Exemplo da adição de um novo diretório

source: This example shows the French translation adding the intro/ directory:
pt_pt: Este exemplo mostra a adição do diretório intro/ na tradução francesa:

source: Make sure a new directory has the Makefile and that it's committed in git.
pt_pt: Certifique-se que o novo diretório tem o Makefile e que seu commit foi feito no git.

source: Otherwise, running make will give an error to everyone else trying it.
pt_pt: Caso contrário, executar o make dará um erro para todos os outros que tentarem.

source: Example of a Conflict
pt_pt: Exemplo de um conflito

source: This example shows a commit that won't work because the copy in the repository has been modified since your last git pull.
pt_pt: Este exemplo mostra um commit que não funcionará porque a cópia do repositório foi modificada desde seu último git pull.

source: You performed some changes to the file foo.wml.
pt_pt: Você realizou algumas alterações no arquivo foo.wml.

source: Then:
pt_pt: Então:

source: will output:
pt_pt: a saída será:

source: or something like that :)
pt_pt: ou algo semelhante :)

source: This means that your changes have not been pushed into the git repository due to conflicts.
pt_pt: Isso significa que suas alterações não foram enviadas para o repositório git, devido a conflitos.

source: You will need to examine what went wrong, solve the conflicts and try to commit/push again.
pt_pt: Você precisará examinar o que deu errado, resolver os conflitos e tentar commit/push novamente.

source: dansk Deutsch español français hrvatski Italiano 한국어 (Korean) Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) svenska українська (ukrajins'ka)
pt_pt: dansk Deutsch English español français hrvatski Italiano 한국어 (Korean) Nederlands 日本語 (Nihongo) polski Русский (Russkij) svenska українська (ukrajins'ka)

source: Last Modified: Fri, Oct 1 05:21:19 UTC 2021 Last Built: Tue, Aug 6 19:41:35 UTC 2024
pt_pt: Última Modificação: Dom, 10 de Out de 2021, 23:11:18 UTC Última compilação: Ter, 6 de Ago de 2024, 22:05:16 UTC

source: Mailing Lists / HOWTO request a mailing list
pt_pt: Listas de Discussão / Como solicitar a criação de uma lista de discussão

source: HOWTO request a mailing list
pt_pt: Como solicitar a criação de uma lista de discussão

source: The scope of this document is to help people establish a mailing list at lists.debian.org.
pt_pt: O objetivo deste documento é ajudar as pessoas a criarem uma lista de discussão em lists.debian.org.

source: All new mailing lists need to have these basic prerequisites:
pt_pt: Novas listas devem atender estes pré-requisitos básicos:

source: · Basic purpose.
pt_pt: · Propósito básico.

source: This means that the topic the new mailing list would cover is appropriate for discussion on a permanent mailing list on lists.debian.org.
pt_pt: O tópico da nova lista deverá ser apropriado para discussão em uma lista permanente em lists.debian.org.

source: Some discussions are better suited for simple mail aliases, and mailing lists for simple package maintenance don't need lists here.
pt_pt: Algumas discussões se encaixam melhor com simples apelidos de email (aliases), e aqui as listas de discussão para manutenção de pacotes simples não são adequadas .

source: Needless to mention, vanity or offtopic lists will not be created.
pt_pt: É desnecessário dizer que listas inúteis ou com tópicos não relevantes (offtopic) não serão criadas.

source: · Interested audience.
pt_pt: · Audiência interessada.

source: This means that requests for new mailing lists need to be based on a real need for a new, separate discussion forum, rather than on the whim of the requester.
pt_pt: As requisições para uma nova lista de discussões devem ser baseadas em uma necessidade real de uma nova lista, para um fórum de debates separado, ao invés de baseadas apenas na vontade do requisitante.

source: A modicum of audience is also necessary to avoid temporary or transient mailing list requests.
pt_pt: Uma audiência mínima também é necessária para evitar pedidos de listas de discussão temporárias ou momentâneas.

source: Once these two prerequisites have been obtained, a proper request needs to be sent in as a wishlist bug report against the lists.debian.org pseudo-package.
pt_pt: Uma vez que esses dois pré-requisitos tenham sido cumpridos, um pedido adequado deve ser enviado como um relatório de bug wishlist contra o pseudopacote lists.debian.org

source: The following information is required in the bug report:
pt_pt: As informações seguintes são necessárias no relatório de bug:

source: Name
pt_pt: Nome

source: Please choose a descriptive, short and unique name.
pt_pt: Por favor escolha um nome representativo, curto e único.

source: Please note that every list name needs to be prefixed with a unique string, most commonly debian- for lists related to the Debian Project.
pt_pt: Por favor note que cada nome de lista deve ser prefixado com uma palavra única, a mais comum sendo debian- para listas relacionadas ao Projeto Debian.

source: Lists for external projects don't need a prefix, as they will be created as listname@other.debian.org.
pt_pt: As listas para projetos externos não precisam de um prefixo, já que elas serão criadas como listname@other.debian.org.

source: Words are separated with a dash, "-", so for example a list about "Foo bar" in relation to Debian would be called debian-foo-bar.
pt_pt: As palavras são separadas por hífen, "-", assim uma lista sobre "Foo bar" em relação ao Debian seria chamada debian-foo-bar.

source: Rationale
pt_pt: Argumento

source: Full explanation on why do you want this list be created.
pt_pt: Uma explicação completa dos motivos pelos quais você deseja que esta lista seja criada.

source: The listmasters reserve the right to ask for consensus on debian-devel and / or debian-project lists first.
pt_pt: Os listmasters se reservam o direito de, preliminarmente, chegar a um consenso na lista debian-devel e/ou debian-project.

source: If you are aware your request is questionable, you can speed up the process by discussing the matter even before filing the bug.
pt_pt: Se você sabe que sua requisição é questionável, você pode acelerar o processo discutindo o assunto antes de preencher o relatório de bug.

source: Short description
pt_pt: Descrição curta

source: This is the one-line description, for display in list indices, so make it short and straightforward.
pt_pt: É a descrição de uma linha, para exibição nos índices de listas, assim faça-a pequena e direta.

source: Long description
pt_pt: Descrição longa

source: This description is meant for people who are looking for the proper list to join, so make sure it's clear and informative.
pt_pt: Essa descrição tem em vista as pessoas que estão procurando uma determinada lista para inscreverem-se, assim deve ser clara e informativa.

source: See the subscription page for examples.
pt_pt: Veja a página de inscrição para exemplos.

source: Category
pt_pt: Categoria

source: This is needed to classify the list and to properly sort it on the subscription page and elsewhere.
pt_pt: Isso é necessário para classificar a lista e colocá-la na categoria correta na página de inscrição e em outros lugares.

source: The available categories can be found on the homepage of lists.debian.org.
pt_pt: As categorias disponíveis podem ser encontradas na página inicial de lists.debian.org.

source: Subscription Policy
pt_pt: Política de inscrições

source: open / closed
pt_pt: aberta / fechada

source: If closed, who may get subscribed, who can approve subscription requests?
pt_pt: Se for fechada, quem pode se cadastrar, quem pode aprovar requisições de subscrição?

source: We usually don't support closed lists, you need a very good reasoning for requesting such a list.
pt_pt: Nós normalmente não apoiamos listas fechadas, você precisará de bons argumentos para requisitar uma lista como essa.

source: Post Policy
pt_pt: Política de envio de mensagem

source: open / moderated
pt_pt: aberta / moderada

source: If moderated, who are the moderators?
pt_pt: Se for moderada, quem serão os(as) moderadores(as)?

source: We usually don't support moderated lists, you need a very good reasoning for requesting such a list.
pt_pt: Nós normalmente não apoiamos listas moderadas, você precisará de bons argumentos para requisitar uma lista como essa.

source: There also doesn't exist a webfrontend or something like that.
pt_pt: E também não existe uma interface web ou outro modo para isso.

source: Moderation is done by mail only.
pt_pt: A moderação é feita somente por e-mail.

source: Web Archive
pt_pt: Arquivamento web

source: yes / no
pt_pt: sim / não

source: At our mailing list archives..
pt_pt: Nos nossos arquivos de listas de discussão.

source: We do expect for list archives to be public, you do need a good reason for not having a web archive.
pt_pt: Nós realmente esperamos que os arquivos de listas sejam públicos, você precisa de um bom argumento para não ter um arquivamento web.

source: After filing the request, it would be very much appreciated if several other people interested in the new list would send a mail to the bug, in order to record their interest.
pt_pt: Depois de preencher a requisição, ficaríamos gratos(as) se outras pessoas com interesse na nova lista enviassem uma mensagem para o relatório de bug, para que interesse delas fique registrado.

source: Please follow the above rules, because improper requests will not be implemented.
pt_pt: Por favor, siga as regras acima, uma vez que requisições impróprias não serão implementadas.

source: Moving existing mailing lists to lists.debian.org
pt_pt: Movendo listas de discussões existentes para lists.debian.org

source: An existing mailing list can be moved to lists.debian.org: the administrator of the list has to submit a request as described above and provide us with a list of subscribers (in plain text format, one address per line).
pt_pt: Uma lista de discussões existente pode ser movida para lists.debian.org: o(a) administrador(a) da lista tem que enviar uma requisição conforme descrito acima e nos dar uma lista de assinantes (em texto puro, um endereço por linha).

source: Archives of the existing list can also be imported from files in mbox format (preferably split per month).
pt_pt: Os arquivos da lista em questão também podem ser importados de formatos de arquivo mbox (preferencialmente separado por mês).

source: In addition to that, they should set up redirections from the old location to the new one, of course.
pt_pt: Além disso, deve-se configurar os redirecionadores da localização antiga para a nova, claro.

source: dansk Deutsch español français hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) suomi svenska українська (ukrajins'ka)
pt_pt: dansk Deutsch English español français hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) polski Русский (Russkij) suomi svenska українська (ukrajins'ka)

source: Last Modified: Sun, Aug 12 13:07:35 UTC 2018 Last Built: Tue, Aug 6 19:26:51 UTC 2024
pt_pt: Última Modificação: Ter, 22 de Fev de 2022, 03:20:35 UTC Última compilação: Ter, 6 de Ago de 2024, 21:57:37 UTC

source: Debian on the Desktop
pt_pt: Debian no Desktop

source: · Our Philosophy
pt_pt: · Nossa filosofia

source: · How you can help
pt_pt: · Como você pode ajudar

source: · Join us
pt_pt: · Junte-se a nós

source: Debian Desktop is a group of volunteers who want to create the best possible operating system for home and corporate workstation use.
pt_pt: O Debian Desktop é um grupo de voluntários(as) que desejam criar o melhor sistema operacional possível para uso doméstico e em estações de trabalho corporativas.

source: Our motto: Software that just works.
pt_pt: Nosso lema: software que simplesmente funciona.

source: Our goal: bringing Debian, GNU, and Linux to the mainstream world.
pt_pt: Nosso objetivo: trazer o Debian, o GNU e o Linux para o mundo mainstream.

source: Our Philosophy
pt_pt: Nossa filosofia

source: We recognize that many Desktop Environments exist and will support the use of them - this includes making sure they work well on Debian.
pt_pt: Reconhecemos que muitos ambientes desktop existem e que suportaremos seu uso – isso inclui certificar que funcionam bem no Debian.

source: Our goal is to make the graphical interfaces easy to use for beginners while allowing advanced users and experts to tweak things if they like.
pt_pt: Nosso objetivo é tornar as interfaces gráficas fáceis de usar para iniciantes, permitindo que usuários(as) avançados(as) e especialistas ajustem as coisas se quiserem.

source: We will try to ensure that software is configured for the most common desktop use.
pt_pt: Tentaremos garantir que o software seja configurado para o uso mais comum no desktop.
